In [ ]:
# pd.to_datetime()
# df.describe(), df.loc(), df.iloc(), df.drop(), df.duplicated(), df.drop_duplicates()
# df.corr() - corr() method ignores "not numeric" columns
# df.plot() - histogram, scatterplot

In [ ]:
#What is a good correlation? It depends on the use, but it is safe to say you have to have at least 0.6 (or -0.6) to call it a good correlation.

In [ ]:
import  pandas as pd
df = pd.read_csv("D:/Python_ML_Course/Wk47/files/cubic_zirconia.csv")
df.head()

In [52]:
import  pandas as pd

Weather_data = [('1/1/2017',32,6,'Rain'),
               ('1/2/2017',35,7,'Sunny'),
               ('1/3/2017',28,2,'Snow'),
               ('1/4/2017',24,7,'Snow'),
               ('1/5/2017',32,4,'Rain'),
               ('1/6/2017',31,2,'Sunny')]
df_weather = pd.DataFrame(Weather_data,columns=['day','Temperature','wind_speed','Status'],index=['a','b','c','d','e','f'])
df_weather

        day  Temperature  wind_speed Status
a  1/1/2017           32           6   Rain
b  1/2/2017           35           7  Sunny
c  1/3/2017           28           2   Snow
d  1/4/2017           24           7   Snow
e  1/5/2017           32           4   Rain
f  1/6/2017           31           2  Sunny

In [25]:
#iloc & loc - if there is no specific indexes then iloc and loc both will work in the same way

df_weather.loc['e']

day            1/5/2017
Temperature          32
wind_speed            4
Status             Rain
Name: e, dtype: object

In [26]:
df_weather.iloc[3]

day            1/4/2017
Temperature          24
wind_speed            7
Status             Snow
Name: d, dtype: object

In [ ]:
df_weather.shape # no of rows*no of columns

In [ ]:
df_weather[2:5]

In [ ]:
df_weather.columns

In [57]:
df_weather[['day','Temperature','wind_speed','Status']] # to retrive two coluns of data

        day  Temperature  wind_speed Status
a  1/1/2017           32           6   Rain
b  1/2/2017           35           7  Sunny
c  1/3/2017           28           2   Snow
d  1/4/2017           24           7   Snow
e  1/5/2017           32           4   Rain
f  1/6/2017           31           2  Sunny

In [9]:
df_weather['Temperature'].max()

35

In [10]:
df_weather['Temperature'].min()

24

In [33]:
df_weather.describe()

       Temperature  wind_speed
count     6.000000    6.000000
mean     30.333333    4.666667
std       3.829708    2.338090
min      24.000000    2.000000
25%      28.750000    2.500000
50%      31.500000    5.000000
75%      32.000000    6.750000
max      35.000000    7.000000

In [16]:
df_weather[df_weather.Temperature == df_weather.Temperature.max()]

        day  Temperature  wind_speed Status
1  1/2/2017           35           7  Sunny

In [18]:
df_new = df_weather[2:5].copy()

In [19]:
df_new

        day  Temperature  wind_speed Status
2  1/3/2017           28           2   Snow
3  1/4/2017           24           7   Snow
4  1/5/2017           32           4   Rain

In [21]:
df_new.to_excel('modified_weather.xlsx', index=False)

In [27]:
g=df_weather.groupby('Status')

In [28]:
g.get_group('Rain')

        day  Temperature  wind_speed Status
a  1/1/2017           32           6   Rain
e  1/5/2017           32           4   Rain

In [29]:
g.get_group('Snow')

        day  Temperature  wind_speed Status
c  1/3/2017           28           2   Snow
d  1/4/2017           24           7   Snow

In [30]:
g.get_group('Sunny')

        day  Temperature  wind_speed Status
b  1/2/2017           35           7  Sunny
f  1/6/2017           31           2  Sunny

In [31]:
g.get_group('Snow').mean()

Temperature    26.0
wind_speed      4.5
dtype: float64

In [32]:
g.get_group('Sunny').describe()

       Temperature  wind_speed
count     2.000000    2.000000
mean     33.000000    4.500000
std       2.828427    3.535534
min      31.000000    2.000000
25%      32.000000    3.250000
50%      33.000000    4.500000
75%      34.000000    5.750000
max      35.000000    7.000000

In [37]:
india_weather = pd.DataFrame({"City":['Mumbai','Delhi','Bengaluru'],
                             "Temperature":[32,45,30],
                             "Humidity":[80,60,78]})

us_weather = pd.DataFrame({"City":['Newyork','Chicago','Silicon_Valley'],
                          "Temperature": [21,14,35],
                          "Humidity": [68,65,75]})

In [35]:
print(india_weather)

        City  Temperature  Humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bengaluru           30        78

In [38]:
print(us_weather)

             City  Temperature  Humidity
0         Newyork           21        68
1         Chicago           14        65
2  Silicon_Valley           35        75

In [40]:
df_new = pd.concat([india_weather,us_weather],axis=1)
df_new

        City  Temperature  Humidity            City  Temperature  Humidity
0     Mumbai           32        80         Newyork           21        68
1      Delhi           45        60         Chicago           14        65
2  Bengaluru           30        78  Silicon_Valley           35        75

In [43]:
df_new_row = pd.concat([india_weather,us_weather],axis=0,ignore_index=True)
df_new_row

             City  Temperature  Humidity
0          Mumbai           32        80
1           Delhi           45        60
2       Bengaluru           30        78
3         Newyork           21        68
4         Chicago           14        65
5  Silicon_Valley           35        75

In [47]:
temp_df = pd.DataFrame({"City":['Mumbai','Delhi','Bengaluru','Hyd'],
                       "Temp": [32,45,30,40]})

humidity_df = pd.DataFrame({"City":['Delhi','Mumbai','Bengaluru'],
                           "Humidity": [68,65,76]})

In [48]:
print(temp_df)

        City  Temp
0     Mumbai    32
1      Delhi    45
2  Bengaluru    30
3        Hyd    40

In [49]:
print(humidity_df)

        City  Humidity
0      Delhi        68
1     Mumbai        65
2  Bengaluru        76

In [50]:
mergerd_df = pd.merge(temp_df,humidity_df,on='City')
mergerd_df

        City  Temp  Humidity
0     Mumbai    32        65
1      Delhi    45        68
2  Bengaluru    30        76

In [51]:
mergerd_df1 = pd.merge(temp_df,humidity_df,on='City',how='outer')
mergerd_df1

        City  Temp  Humidity
0     Mumbai    32      65.0
1      Delhi    45      68.0
2  Bengaluru    30      76.0
3        Hyd    40       NaN